app/views/movies/show.html.erb

SELECT "genres".* FROM "genres" INNER JOIN "categorizations" ON "genres"."id" = "categorizations"."genre_id" WHERE "categorizations"."movie_id" = $1  [["movie_id", 8]]
---
    <p>Release Year: <%= @movie.release_year %></p>
    <p>Genres: <% @movie.genres.each do |genre| %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1  [["movie_id", 8]]
---
      <h3>Trusted Movie Reviews</h3>
      <% @movie.trusted_reviews.each do |review| %>